'''
เรื่องเล่าจากโจทย์
จากปัจจุบันมีหนึ่งสิ่งที่เกิดขึ้นมาบนโลกแล้วมีความสำคัญกับโลกมากๆ ซึ่งทำให้เราขึ้นไปบนที่สูงได้ง่ายขึ้นนั่นก็คือ 'บันได' นั่นเอง
ซึ่งเด็กหญิงสมจริงที่รักในงานศิลปะเขาสามารถจ้องมองบันไดที่บ้านนิ่ง ๆ โดยไม่ขยับไปไหนได้เป็นชั่วโมงๆ แต่วันหนึ่งป้าสมหมีกลัวว่าเด็กหญิงสมจริงจะตกบันไดที่บ้าน ฒิพฬป้าจึงปิดปรับปรุงบันไดชั่วคราว แต่เด็กหญิงสมจริงนั้นร้องไห้ไม่หยุดเพราะต้องการมองดูบันไดของเขาต่อ
ดังนั้นแล้วเขาจึงให้เราสร้างโปรแกรมเพื่อแสดงรูปบันไดออกมาบนหน้าจอ เด็กหญิงสมจริงจะได้เงียบลงเสียที
(ไม่มีการรับ input และสำหรับข้อความที่ให้แสดงผล ดูได้จากตารางด้านล่าง)
Output
*
**
***
****
*****
******
'''

for i in range(6):
  print('*' * (i+1))
