'''เขียนโปรแกรมให้เกรด
ผู้ที่ได้คะแนนตั้งแต่ 90 คะแนนขึ้นไปจะได้เกรด A
ผู้ที่ได้คะแนนตั้งแต่ 85 - 89 จะได้เกรด B+
ผู้ที่ได้คะแนนตั้งแต่ 80 - 84 จะได้เกรด B
ผู้ที่ได้คะแนนตั้งแต่ 75 - 79 จะได้เกรด C+
ผู้ที่ได้คะแนนตั้งแต่ 70 - 74 จะได้เกรด C
ผู้ที่ได้คะแนนตั้งแต่ 65 - 69 จะได้เกรด D+
ผู้ที่ได้คะแนนตั้งแต่ 60 - 64 จะได้เกรด D
ผู้ที่ได้คะแนนต่ำกว่า 60 ลงไปจะได้เกรด F'''
myInput = int(input())
if myInput < 60 :
  print('F')
elif myInput < 65 :
  print('D')
elif myInput < 70 :
  print('D+')
elif myInput < 75 :
  print('C')
elif myInput < 80 :
  print('C+')
elif myInput < 85 :
  print('B')
elif myInput < 90 :
  print('B+')
else:
  print('A')