'''
จำได้หรือไม่เมื่อโปรแกรมของบทเรียนตอนที่แล้ว ? แต่เมื่อคุณครูวิชาวิทยาศาสตร์ แขนงวิชา ฟิสิกส์นิวเคลียร์ ฝ่ายมัธยมต้นใช้โปรแกรมดังกล่าว แล้วดันกรอกข้อมูลผิดเข้าไปในระบบจาก 100 เป็น 1000 ซึ่งโปรแกรมดังกล่าวก็ยังทำงานได้อยู่ ทั้งๆที่โรงเรียนได้บอกไว้แล้วว่าคะแนนจะอยู่ในช่วง 0 - 100 เท่านั้น ดังนั้นแล้ว
ให้เราทำการแก้ไขโปรแกรมข้อดังกล่าวให้กรอกได้แค่ 0 - 100 เท่านั้นก่อนนำไปคำนวณผลเพื่อตัดเกรด โดยถ้าเกิดกรอกถูกต้องจะแสดงข้อมูลเช่นในข้อที่ 10 เหมือนเดิม แต่ถ้าเกิดกรอกต่ำกว่าหรือเกิน ให้แจ้งว่าไม่สามารถกรอกได้ดังตัวอย่าง
'''
myInput = int(input())
if myInput < 0 :
  print('Error : Value must be greater than or equal to 0.')
elif myInput < 60 :
  print('F')
elif myInput < 65 :
  print('D')
elif myInput < 70 :
  print('D+')
elif myInput < 75 :
  print('C')
elif myInput < 80 :
  print('C+')
elif myInput < 85 :
  print('B')
elif myInput < 90 :
  print('B+')
elif myInput <= 100 :
  print('A')
elif myInput > 100 :
  print('Error : Value must be less than or equal to 100.')