'''
ให้ทำการสร้างต้นคริสมาสต์จากความสูงที่รับเข้ามาโดยมีตัวอย่างดังภาพ
รูปเเบบ Input
บรรทัดแรก จำนวนเต็ม n เป็นความสูงของต้นคริสมาสต์
รูปเเบบ Output
แสดงต้นคริสมาสต์ตามความสูงที่รับเข้ามา
ข้อจำกัด
0<n<100
Input : 2
  *         1
 ***        3
  *         1
 ***        3
*****       5 (2x+1)
  |         3 (in+1)  center
==V==

Input : 3
   *        1
  ***       3 (2r)
   *        1
  ***       3
 *****      5 (3r)
   *        1
  ***       3
 *****      5
*******     7 (2x+1) (4r)
   |        4 (in+1) center
===V===
'''

inp = int(input(">> "))
print(type(inp))

space = inp+1
x = 1
for i in range(inp):
    while inp != x :
        x = 1
        print((' '*space) + ("*"*(2*x-1)) )
        x += 1
        print((" "*(space-1)) + ("*"*(2*x-1)) )

