'''
เมื่อ Y ปีที่แล้วนายA แก่กว่านายB เป็นจำนวน M เท่า และปัจจุบันนายA แก่กว่านายB เป็นจำนวน N ปี ถามว่าตอนนี้ทั้งคู่อายุเท่าไร
Input 3 ตัว     1 2 3   / 6 2 8
Output 2 ตัว    5 4     / 20 14
'''
N, M, Y = input('N M Y').split() # input n ปีที่ a แก่กว่า b
#m = int(input()) # input m เท่า ที่ y ปีมาแล้ว
#y = int(input()) #input y ปีที่แล้ว

n = int(N)
m = int(M)
y = int(Y)

'''
สมการ
ัy ปีที่แล้ว อายุ
a = mb      ..........1
ปัจจุบัน
(a+y) - (b+y) = n
a + y - b - y = n
a - b = n   
a = b + n   ..........2

a = a  จาก 1 = 2
mb = b + n ย้ายฝั่ง n ไปซ้าย
n = mb - b กระจายวงเล็บให้เหลือ b ตัวเดียว
ืn = b(m-1) ย้ายกลับข้างอีกที
b = n / (m-1)
a = m( n / (m-1) )
'''
b = (n / (m-1)) + y
a = (m*( n / (m-1) )) + y

print(int(a),int(b))