'''
ให้เขียนโปรแกรมจัดการหมวดหมู่ของตัวเลขแบบกำหนดเอง โดยจะมีการตั้งชื่อให้ในแต่ละหมวกหมู่ โดยตัวเลขจะเป็นจำนวนเต็มทั้งหมด และแต่ละหมวดหมู่จะมีทับซ้อนกัน

บรรทัดแรก ค่า X เป็นค่าที่ต้องการนำไปจัดหมวดหมู่
บรรทัดที่ 2 ค่า N เป็นจำนวนหมวดหมู่ที่มี
บรรทัดต่อไป เลขจำนวนเต็ม F T ค่าสำหรับบอกขอบเขตแต่ละหมวดหมู่ และตามด้วยชื่อของหมวดหมู่

อธิบายเพิ่มเติม ตัวเลขที่ input เข้ามาบรรทัดแรก คือ ตัวเลขที่อยู่ ระหว่าง ของชุดข้อมูล
เช่น เลือกเลข 5 ตัวเลขของ 1 - 100 มี 5 อยู่ ก็คือล็อตนี้

In :
1
3
-100 -1 negative
0 0 null
1 100 positive

Out : positive
'''

x = int(input(' number of X >> ')) # input ที่จะเอาไปหาหมวดหมู่
n = int(input(' How many catagorie? >> ')) # input หมวดหมู่ที่มีทั้งหมด

fn, fm , t = 1 , 100 , 'positive' # min max ของข้อมูลชุดนั้น + ชื่อ
answer = ''

for i in range(0,n):
    FN, FM, t = input('>> ').split()
    fn = int(FN)
    fm = int(FM)
    #print(i)
    #print(type(fn))
    if x >= fn and x <= fm:
        answer = t
    else:
        pass

print(answer)

