'''
เขียนโปรแกรมคำนวณความได้เปรียบเสียเปรียบของหมากรุก โดยคำนวณจากหมากที่เหลืออยู่บนกระดานว่าตอนนี้เราได้เปรียบหรือเสียเปรียบอยู่เท่าใด
หากได้เปรียบให้แสดงค่าเป็นจำนวนเต็มบวก และถ้าเสียเปรียบให้แสดงค่าเป็นจำนวนเต็มลบ ซึ่งเราะใช้ตัวอักษรพิมพ์ใหญ่แทนหมากของเรา

โดยค่าของหมากแต่ละตัวจะแตกต่างออกไปดังนี้
Pawn: P,p  มีค่า 1 คะแนน        **P ใหญ่ ของเรา = +1  pเล็ก ของเขา = -1**
Knight: N,n มีค่า 3 คะแนน
Bishop: B,b มีค่า 3 คะแนน
Rook: R,r  มีค่า 5 คะแนน
Queen: Q,q มีค่า 9 คะแนน
King: K,k  มีค่า 0 คะแนน
หาผลรวมแล้วแสดงออกมาว่าเท่าไหร่
ถ้าเท่ากับ 0 ให้แสดงว่า equal

รูปเเบบ Input
ข้อมูล 8 บรรทัด แต่ละบรรทัดจะมีตัวอักษรทั้งหมด 8 ตัวอักษร
.r..k...
.....p.p
......p.
.r.....P
.....QP.
......K.
.....P..
........

Output : 3  / -1  /  -22 / equal
'''

sum = 0
for i in range (0,8):
    chess = input('Code >> ')
    for j in range (0,8):
        print(chess[j])
        if chess[j] == 'P':
            sum += 1
        elif chess[j] == 'p':
            sum -= 1
        elif chess[j] == 'N':
            sum += 3
        elif chess[j] == 'n':
            sum -= 3
        elif chess[j] == 'B':
            sum += 3
        elif chess[j] == 'b':
            sum -= 3
        elif chess[j] == 'R':
            sum += 5
        elif chess[j] == 'r':
            sum -= 5
        elif chess[j] == 'Q':
            sum += 9
        elif chess[j] == 'q':
            sum -= 9
        else:
            pass

    #print(sum)
    #print('---------------------')

if sum == 0:
    print('equal')
else:
    print(sum)