'''
ในเวลาว่างของนายเซฟ เขามักจะชอบคิดโจทย์ปัญหามาให้เพื่อนๆของเขาแก้เสมอ วันนึงเขาเดินมาพร้อมกับถัง 3 ใบที่มีลูกบอลอยู่เต็มถัง
เขาถามเพื่อนของเขาว่าในถังใบที่หนึ่งและสองมีลูกบอลสีอะไรบ้างที่เหมือนกัน และสีที่เหมือนกันนั้นต้องไม่มีอยู่ในถังที่สามด้วย
เราที่สามารถเขียนโปรแกรมได้ จะเขียนโปรแกรมช่วยเพื่อนของนายเซฟได้อย่างไร
Out : สีของลูกบอลที่มีอยู่ในถังที่หนึ่งและสอง แต่ไม่มีอยู่ในถังที่สาม (กรณีที่ไม่มีลูกบอลสีใดเลยที่ตรงตามเงื่อนไข ให้ผลลัพธ์ออกเป็น none)

Input: b1=[red,green,blue] b2=[black,green,white] b3=[blue]
Out : green
'''