'''
เด็กชายเป็ดน้อยต้องการหาค่าเฉลี่ยของข้อมูลโดยแสดงผลเป็นค่าเฉลี่ยโดยมีทศนิยม 2 ตำแหน่ง
รับค่าจำนวนจริงบวกเรื่อย ๆ จนกว่าจะพบค่าติดลบหรือศูนย์
ค่าเฉลี่ยของ input ทั้งหมด ยกเว้นจำนวนที่ติดลบหรือศูนย์
หากรับมาจำนวนแรกเป็นลบหรือศูนย์ให้แสดงข้อความว่า No Data
In :
123.45
32.87
89.6673
1234.5678
-5.654
Out : 370.14
'''

lib = []
while True:
    x = float(input())
    if x > 0:
        lib.append(x)
    else:
        break
#print(lib)
sum = 0
for i in lib:
    sum = sum + i


if len(lib) > 0:
    mean = sum / len(lib)
    print('{:.2f}'.format(mean))
else:
    print('No Data')
