'''
มีนักวิ่ง 2 คน (R1,R2) วิ่งโดยเริ่มที่จุด x1,x2 บนเส้นจำนวน ตามลำดับ (-10000<=x1<x2<=10000)
เมื่อเริ่มวิ่ง นักวิ่งจะวิ่งไปทางขวาของเส้นจำนวนพร้อมกัน โดย R1 วิ่งด้วยอัตราเร็ว v1 หน่วย/วินาที
และ R2 วิ่งด้วยอัตราเร็ว v2 หน่วย/วินาที (1<=v2<v1<=100) และอัตราเร็วทั้งคู่จะไม่เพิ่มไม่ลด
จงหาว่า R1 ใช้เวลากี่วินาทีในการแซง R2

มี 2 บรรทัด
บรรทัดที่ 1 รับค่าของจำนวนเต็ม x1 และ x2 แทนจุดเริ่มต้นของ R1 และ R2 บนเส้นจำนวน ตามลำดับ (-10000<=x1<x2<=10000)
บรรทัดที่ 2 รับค่าของจำนวนเต็ม v1 และ v2 แทนอัตราเร็วของ R1 และ R2 ตามลำดับ (1<=v2<v1<=100)
(สังเกตว่า v2<v1 และ x1<x2)

inp :
-2 8 (a start -2  / b start 8)
3 2 (a v=3 / b v=2)
Out : 10 ( 10 วิ a == b ที่เส้นจำนวน 28)
ช่วงกระดาษทด
v = s/t
a>  3 = s/10
    s = 30 (มุ่งหน้าไป 30 หน่วยถึงเท่ากัน ที่จุด 28)
    p ==  v = s/t  (หาว่าจุดปัจจุบันอยู่ตรงไหน)
          3 = s / 1
          s = 1*3 = 3
          p = s+o  (s = ระยะที่วิ่งไป o = จุดเริ่ม)
            = 3+(-2)
            = 1

b>  2 = s/10
      = 20 (มุ่งหน่าไป 20 หน่วยถึงเท่ากัน ที่จุด 28)
        p ==  v = s/t  (หาว่าจุดปัจจุบันอยู่ตรงไหน)
        2 = s / 1
        s = 1*2 = 2
        p = s+o  (s = ระยะที่วิ่งไป o = จุดเริ่ม)
          = 2+(8)
          = 10
หาว่า เมื่อไหร่ที่ p1 >= p2 โดยการ run t ไปเรื่อยๆ
'''
import math

x1,x2 = input().split(' ')
start1 = int(x1)
start2 = int(x2)
w1,w2 = input().split(' ')
v1 = int(w1)
v2 = int(w2)

# v = s/t
# s = v*t (รันวิ)
s1 = 0 #ระยะทางที่ทำได้
s2 = 0
t = 0 #เวลาเริ่ม
p1 = -1 #จุดปัจจุบัน
p2 = 0 #จุดปัจจุบัน
while p1 < p2:
    t += 1
    #x1
    s1 = t*v1
    print('S1 =',s1)
    p1 = s1 + start1
    print('Point =',p1)
    #x2
    s2 = t * v2
    print('S2 =', s2)
    p2 = s2 + start2
    print('Point =', p2)


print(t)
