'''
ลิงเป็นสิ่งที่ชาวบ้านไม่ชอบเพราะชอบขโมยของหรือผลไม้ในสวน ชาวบ้านจึงได้คิดวิธีในการจับลิง โดยใช้กล่องเจาะรูเล็กๆให้ลิงพอเอามือสอดเข้าไปได้
หลังจากนั้นก็ใส่ถั่วที่ลิงชอบเข้าไป เมื่อลิงมาเจอก็จะเอามือล้วงเข้าไปหยิบถั่ว แต่เนื่องจากมันกำถั่วไว้เต็มฝ่ามือทำให้ไม่สามารถดึงมือออกจากล่องได้
เพราะกำมือนั้นใหญ่กว่ารูปที่เจาะไว้ทำให้ถูกชาวบ้านจับได้ง่ายๆ เนื่องจากเรากำลังหวนคืนสู่วานร
ซีซาร์จึงต้องการให้ลิงฉลาดเลยให้เราทำการสร้างโปรแกรมคำนวณให้กับเหล่าวานรทึ่กำลังจะถูกจับให้เอามือออกจากกล่องได้โดยที่กำเอาถั่วออกมาได้มากที่สุด
บรรทัดแรก เส้นผ่านศูนย์กลางของรูที่กล่อง
บรรทัดสอง ขนาดของมือลิง
บรรทัดสาม จำนวนถั่วภายในกล่อง
บรรทัดสี่ ขนาดมือที่เพิ่มขึ่นต่อถั่ว 1 ชิ้น

In :
6
4
20
0.5

Out :
4
'''

cir_length = float(input())
mk_hand = float(input())
total_bean = float(input())
magni = float(input())
bean_count = 0
while mk_hand < cir_length:
    mk_hand = round(mk_hand + magni,2) #Edit representative error
    bean_count += 1
    #print(mk_hand)
    #print(bean_count)

print(bean_count)