'''
ต้าว พึ่งเรียนฟิสิกส์เรื่องการตกอย่างอิสระมาเขาจึงอยากลองโยนบอลในแนวดิ่งดู
โดยที่อยากจะโยนบอลให้สูงเท่ากับที่ตัวเองคิดแต่ขี้เกียจคำนวณความเร็วต้นเองจึงให้เพื่อนที่เก่งคอมพิวเตอร์เขียนโปรแกรมคำนวณความเร็วต้นให้ให้โดยใช้สูตร
v^2 = u^2 + 2gs
**เผื่อคนที่ลืมแล้วนะจ้ะ**
v = ความเร็วปลาย (m/s)
u = ความเร็วต้น (m/s)
g = ความเร่งโน้มถ้วง (m/s^2) **กำหนด 10 m/s^2 **
s = ความสูงที่โยนขึ้นไป

In : ค่า s (หน่วย เมตร)                                 : 20            125
Out : ความเร็วต้น (เมตรต่อวินาที) **ตอบทศนิยมสองต่ำแหน่ง**      :20.00 m/s      50.00 m/s

u**2 = 0 - 2gs
'''

import math
s = int(input())
g = 10
uxx2 = (2*g*s)
u = math.sqrt(uxx2)
print('{:.2f} m/s'.format(u))