'''
ผมมีวงกลมสมมาตรแต่สงสัยว่าถ้ายัดสี่เหลี่ยมจัตุรัสเข้าไปในวงกลมสมมาตร
อยากรู้ว่าความยาวรอบรูปและพื้นที่ของสี่เหลี่ยมจัตุรัสรูปที่ใหญ่ที่สุดที่สามาตรยัดในวงกลมสมมาตรคือเท่าไรกัน !?

In : เส้นผ่าศูนย์กลางของวงกลมสมมาตร
Out : ความยาวรอบรูป และพื้นที่ตามลำดับ แสดงเป็นทศนิยม 2 ตำแหน่ง

In : 25.45
Out :
71.98 (ความยาวรอบรูปของสี่เหลี่ยม)
323.85 (พื้นที่ของสี่เหลี่ยม ด้าน*ด้าน) :.2f
'''

import math
r = float(input())
length = 4 * (math.sqrt((r**2)/2))
area = (r**2) / 2

print('{:.2f}'.format(length))
print('{:.2f}'.format(area))