'''
คุณกำลังตกในสถานการณ์ที่ยากลำบาก ข้างหน้าของคุณคือสายไฟ 3 เส้น หากคุณตัดถูก คุณจะรอด แต่ถ้าคุณตัดผิด คุณก็จะไม่รอด
คุณมีเวลาในการกู้ระเบิดนี้ไม่นานนัก แต่เนื่องจากข้าง ๆ นั้นคือคู่มือในการแก้สายไฟชุดนี้ และคุณพอมีฝีมือในการเขียนโปรแกรมอยู่บ้าง
ดังนั้นคุณจึงต้องทำให้ดีที่สุด!
------------------------------------------------------------------------------
ในคู่มือมีดังนี้
1.สายไฟ 3 เส้นนี้ แต่ละเส้นจะมีสีได้แค่ 4 สีนี้เท่านั้น
1.1 สีแดง (Red)
1.2 สีเหลือง (Yellow)
1.3 สีน้ำเงิน (Blue)
1.4 สีขาว (White)
2. หากในชุดสายไฟไม่มีสายไฟสีแดงเลยให้ตัดสายไฟเส้นที่สอง
3. หากไม่ใช่เช่นนั้น ถ้าสายไฟอันสุดท้ายคือสีขาวให้ตัดสายไฟอันสุดท้าย
4. หากไม่ใช่เช่นนั้น ถ้ามีสายไฟสีน้ำเงินมากกว่าหนึ่งเส้นให้ตัดสายไฟเส้นแรก
5. หากไม่ตรงตามเงื่อนไขข้างบนเลยสักข้อ ให้ตัดสายไฟเส้นสุดท้าย

In : มี 3 บรรทัด ให้ใส่สีของสายไฟ 3 เส้น เส้นละบรรทัด
Blue
Red
Red
Out : แสดงผลว่าต้องตัดสายไฟเส้นใด
Third Line
'''

a = input()
b = input()
c = input()

red = 'Red'
blue = 'Blue'
yellow = 'Yellow'
white = 'White'

color = [red,blue,yellow,white]
#print(color)

# ถ้ากรอกผิด Error
if (a or b or c) not in color:
    print('ERROR')
# ถ้าไม่มีแดง ตัดเส้น 2
elif a != red and b != red and c != red :
    print('Second Line')
elif c == white:
    print('Third Line')
elif a == blue and b == blue:
    print('First Line')
elif a == blue and c == blue:
    print('First Line')
elif b == blue and c == blue:
    print('First Line')
else:
    print('Third Line')
