'''
วันหนึ่ง มีเพื่อนต้องการจ้างคุณทำกราฟิกด้วยราคา 20 บาท โดยที่ให้บรีฟมาว่า
"ชื่อเล่นเราขึ้นต้นด้วยตัว H งั้นขอข้อความเจ๋ง ๆ 2 ข้อความที่อยู่บนตัว H ละกัน
แต่ถ้าข้อความนั้นขึ้นต้นด้วยตัว H ช่วยเอาตัวหน้าออกด้วยนะ ขอบคุณมาก"
-------------------------------------------------------------------------------------------
โดยในโจทย์นี้ ต้องการให้แสดงผลเพียงแค่ข้อความ 2 ข้อความอยู่ข้างบนชั้นบนของตัว H เท่านั้น
หากข้อความนั้นขึ้นต้นด้วยตัว H ให้นำตัวหน้าของคำแรกออก
เช่น Hello World => Ello World

In : มีสองบรรทัด บรรทัดที่ 1 เป็นคำที่ 1 และบรรทัดที่ 2 เป็นคำที่ 2
SCHOOL
GANG

Out :
| SCHOOL GANG |
|—————————————|
|             |
'''
x = 0
x1 = input().upper()
if x1[0] == 'H':
    x = x1[1:]
else:
    x = x1

print(x)
y = input().upper()
xl = len(x)
yl = len(y)
rep = xl+yl+3



print('|',x,y,'|')
print('|',('—'*rep),'|',sep='')
print('|',(' '*rep),'|',sep='')