'''
จงเขียนโปรแกรมเพื่อตรวจสอบว่าจำนวนที่รับเข้ามา เกิดจากจำนวนเต็มตัวใดตัวหนึ่งยกกำลัง 2 หรือไม่
รับจำนวนเต็มเข้ามา 1 ตัว
ถ้าเกิดจากจำนวนเต็มตัวใดตัวหนึ่งยกกำลัง 2 ให้แสดงจำนวนเต็มนั้นออกมา(โดยไม่มีจุดทศนิยม)
ถ้าไม่ใช่ ให้แสดงคำว่า false
ข้อยกเว้นคือ ถ้า input เท่ากับ -1 ให้แสดงตัว i ออกมมา
'''
import math

x = int(input())
if x == -1 :
    print('i')
elif x == 0:
    print(0)
elif x < -1:
    print('false')
else:
    answer = math.sqrt(x)
    if answer.is_integer():
        print(int(answer))
    else:
        print('false')

