'''
นายเซฟได้ส่งจดหมายรักไปหาสาวข้างบ้าน สาวข้างบ้านเกิดงงว่าใครส่งตัวเลขมาให้ เขาจึงได้ถือจดหมายมาให้นักสืบ
สืบว่านายเซฟส่งอะไรมาให้ เขาจึงตอบว่านายเซฟมาสารภาพรักคุณ
สาวข้างบ้านนั้นรู้สึกกระวนกระวายมาก เพราะไม่เคยมีหนุ่มคนไหนมาจีบเลย เธอจึงปรึกษาหลายต่อหลายคน
และเขียนจดหมายปฏิเสธว่าจะเทนายเซฟ ทีนี้มาถึงตาของนายเซฟแล้ว มาแปลจดหมายที่สาวข้างบ้านได้ส่งมา
ซึ่งนายเซฟไม่ทราบว่าตนโดนเท //น่าเศร้านะครับโดนเทนี่
การแปลงตัวอักษรภาษาอังกฤษเป็นตัวเลขสามารถแปลได้ดังนี้
A=1 B=2 C=3 D=4 E=5 F=6 G=7 H=8 I=9 J=10 K=11 L=12 M=13 N=14 O=15 P=16 Q=17
R=18 S=19 T=20 U=21 V=22 W=23 X=24 Y=25 Z=26
'''

a 