'''
รัฐบาลของประเทศกะลาแลนด์ได้ออกกฎหมายเกี่ยวกับการจ่ายภาษีรายได้ต่อปีไว้ดังนี้
ถ้ามีรายได้ตั้งแต่ 0-100000 กะลา ไม่ต้องจ่ายภาษี
ถ้ามีรายได้ตั้งแต่ 100001-300000 กะลา ต้องจ่ายภาษี 10%
ถ้ามีรายได้ตั้งแต่ 300001-500000 กะลา ต้องจ่ายภาษี 15%
ถ้ามีรายได้ตั้งแต่ 500001-1000000 กะลา ต้องจ่ายภาษี 20%
ถ้ามีรายได้มากกว่า 1000000 กะลา ต้องจ่ายภาษี 25%
โดยที่ครอบครัวของคุณประหยัดมีสมาชิก n คน ให้หาว่าครอบครัวนี้ต้องจ่ายภาษีรวมเท่าไหร่

บรรทัดที่ 1 รับค่าจำนวนสมาชิกในครอบครัว
บรรทัดถัดมารับค่ารายได้ (เป็นจำนวนเต็ม) ของสมาชิกในครอบครัวจนครบทุกคน

เสียภาษีทั้งหมด x กะลา
ถ้าเสียภาษี 0 กะลาให้แสดงว่า "ไม่ต้องเสียภาษี"
'''

member_input = int(input())

saraly_lib = []

for i in range(0,member_input):
    x = int(input())
    saraly_lib.append(x)
print(saraly_lib)

tax_lib = []
for i in saraly_lib:
    tax = 0
    if i > 1000000:
        tax = i * 25 / 100
        print(tax,'tax')
    elif i > 500001:
        tax = i * 20 / 100
    elif i > 300001:
        tax = i * 15 / 100
    elif i > 100001:
        tax = i * 10 / 100
    elif i >= 0:
        tax = i * 0
    tax_lib.append(tax)

print(tax_lib)
total_tax = 0
for i in tax_lib:
    total_tax += i

if total_tax == 0:
    print('ไม่ต้องเสียภาษี')
else:
    print('เสียภาษีทั้งหมด {} กะลา'.format(int(total_tax)))


