'''
ณ ตอนนี้เวลาก็ได้ผ่านมาพักหนึ่งแล้วเด็กหญิงชนิกาก็ได้เติบโตขึ้นมาจากแต่ก่อนและมีความขยับมากกว่าเดิมแต่เธอนั้นกลัวที่จะลืมในสิ่งที่ตนเองต้องทำ
จึงของให้พี่ชายของเธอนั้นช่วยเตือนเธอถึงส่งที่เธอต้องทำ แต่ตามเคยพี่ชายของเธอนั้นเป็นคนที่ขี้เกียจจึงมาขอร้องให้คุณโปรแกรมสุดเก่งคนดีคนเดิม
มาช่วยในการทำโปรแกรมแจ้งเตือนในสิ่งที่ต้องทำและยังคงเหลืออะไรที่ต้องทำบ้าง
ตารางสิ่งที่ต้องทำประจำวันของเด็กหญิงชนิกา

เรียนคณิตศาสตร์online
เรียนอังกฤษonline
เรียนไทยonline
เรียนวิทย์online
อ่านเตรียมสอบ o-net
ทำงานบ้าน
เรียนวาดรูป
เรียนร้องเพลง

ใส่สิ่งที่เธอทำไปแล้ว >> บอกว่าเหลืออีกกี่อย่างที่เธอต้องทำและทำอะไรบ้าง?
In : เรียนคณิตศาสตร์online,เรียนอังกฤษonline,เรียนไทยonline,เรียนวิทย์online,เรียนร้องเพลง
Out :
ยังเหลือสิ่งที่ต้องทำอีก 3 อย่าง
- อ่านเตรียมสอบ o-net
- ทำงานบ้าน
- เรียนวาดรูป
'''

user_input = 'เรียนคณิตศาสตร์online,เรียนอังกฤษonline,เรียนไทยonline,เรียนวิทย์online,เรียนร้องเพลง' #input()
done = user_input.split(',')
print(done)

full_course = ['เรียนคณิตศาสตร์online',
'เรียนอังกฤษonline',
'เรียนไทยonline',
'เรียนวิทย์online',
'อ่านเตรียมสอบ o-net',
'ทำงานบ้าน',
'เรียนวาดรูป',
'เรียนร้องเพลง']
print(full_course)

incomplete = []

left = 0
for i in full_course:
    if i not in done:
        left += 1
        incomplete.append(i)
    else:
        pass

print('ยังเหลือสิ่งที่ต้องทำอีก', left, 'อย่าง')
if left > 0 :
    for i in incomplete:
        print('-',i)