'''
เราอยากรู้ว่า เขากดวงกลมตามจังหวะเพลงได้แม่นขนาดไหนกันเชียว โดยสูตรคำณวณมีอยู่ว่า
Accuracy = ((50 * n50) + (100 * n100) + (300 * n300)) / (300 * (n0 + n50 + n100 + n300))
n0 คือ จำนวนครั้งที่กดได้แต้ม 0
n50 คือ จำนวนครั้งที่กดได้แต้ม 50
n100 คือ จำนวนครั้งที่กดได้แต้ม 100
n300 คือ จำนวนครั้งที่กดได้แต้ม 300

รูปเเบบ Input
รับเป็นจำนวนครั้งของแต้มที่กดได้ เรียงลำดับจาก 300, 100, 50, 0

รูปเเบบ Output
แสดงเป็นเลขทศนิยมสองหลักตามด้วย % เสมอ เช่น 99.25%, 100.00%
'''

n300 = int(input())
n100 = int(input())
n50 = int(input())
n0 = int(input())

accuracy = ((50 * n50) + (100 * n100) + (300 * n300)) / ((300 * (n0 + n50 + n100 + n300)))
print('{:.2f}%'.format(accuracy*100))