'''
นายศุภวิชญ์ เป็นเพื่อนกับนายกฤศ นายศุภวิชญ์มักจะเรียกชื่อนายกฤศว่า "karit" ซึ่งถ้าเรียกให้ถูก ต้องเรียกว่า "krit"
พอนายศุภวิชญ์เรียกชื่อผิดบ่อยๆ นายกฤศจึงโมโห แล้วตั้งใจจะขโมยเงิน โดยในตอนแรกนายศุภวิชญ์มีเงินอยู่ x บาท
เมื่อนายศุภวิชญ์เรียกชื่อผิด n ครั้ง นายกฤศจะเริ่มขโมยเงินนายศุภวิชญ์ โดยการขโมยครั้งที่ m จะขโมยไป m บาท
ถ้าเงินที่ขโมยทั้งหมดเกิน 1000 บาทหรือขโมยจนศุภวิชญ์ไม่เหลือเงิน นายศุภวิชญ์จะรู้ตัวแล้วแจ้งจับนายกฤศ
ให้แสดงผลเป็น "Krit was arrested" แต่ถ้าไม่ให้แสดงผลลัพธ์ออกมาเป็นจำนวนเงินที่นายศุภวิชญ์เหลืออยู่

รูปเเบบ Input
บรรทัดที่ 1 รับค่า x แทนจำนวนเงินที่นายศุภวิชญ์มีอยู่ในตอนแรก
บรรทัดที่ 2 รับค่า n แทนจำนวนครั้งที่นายกฤศให้อภัย(ไม่ขโมยเงิน)
บรรทัดที่ 3 รับค่า g แทนจำนวนครั้งที่เรียกชื่อผิดทั้งหมด

รูปเเบบ Output
จำนวนเงินที่นายศุภวิชญ์เหลืออยู่ หรือไม่ก็ "Krit was arrested"

'''

x = int(input())    #มีตัง
n = int(input())    #เรียกผิดไม่คิดตัง
m = n+1             #start at
mget = n+1
g = int(input()) +1    #End not include
get = 0

for i in range(m,g):
    get += i

print(get)
x = x - get


#answer
if x > 0 and get < 1000 :
    print(x)
elif get >= 1000 :
    print('Krit was arrested')
else:
    print('Krit was arrested')


