'''
มีผู้โดยสาร 3 คน รอ Taxi อยู่จุดต่างๆ บนแนวแกน x
โดย 0 คือตำแหน่งรถ Taxi และ จะกลับมาตำแหน่งเดิมเสมอหลังส่งคนหนึ่งเสร็จ
จะ รับคนที่ไปถึงใกล้ที่สุดก่อน เนื่องจากแถวนี้มี Taxi คันเดียวจึงต้องรับทุกคนที่รอแน่นอน
เมื่อขึ้นรถผู้โดยสาร จะระบุระยะทางที่จะไปด้วย ให้ลองเขียนโค้ดเพื่อหา
ระยะทางของแต่ละคน จากที่รถวิ่งไปหา บวก กับระยะทางที่ผู้โดยสารจะไป
หมายเหตุ ถ้าระยะทางใกล้เท่ากัน Taxi จะไปหา จากทางซ้ายไปขวาของค่าที่รับมา

บรรทัดแรก : ตำแหน่งผู้โดยสาร 3 คน บนแกน x (เว้นวรรคแต่ละคนด้วยช่องว่าง 1 ช่อง)
-1 3 5
อีก 3 บรรทัด : เป็นระยะทางที่ผู้โดสารต้องการจะไปของแต่ละคนตามลำดับความใกล้
12
3
7

รูปเเบบ Output
3 บรรทัดคือ ระยะทางที่รถวิ่งไปหาผู้โดยสาร บวก ระยะทางที่ผู้โดยสารจะไป
Distance1 = 13
Distance2 = 6
Distance3 = 12
'''

x = '-6 -12 6' #input()
p1 = 7   #int(input())
p2 = 12  #int(input())
p3 = 8   #int(input())

x01,x02,x03 = x.split(' ')
x1 = abs(int(x01))
x2 = abs(int(x02))
x3 = abs(int(x03))
x_lst = []
x_lst.append(x1)
x_lst.append(x2)
x_lst.append(x3)
x_lst.sort()
print(x_lst)
x1 = x_lst[0]
x2 = x_lst[1]
x3 = x_lst[2]

dis_lst = []
distance = 0

p1_dist = x1 + p1  #abs(x) force x to positive ++
print('Distance1 =',p1_dist)

p2_dist = x2 + p2
print('Distance2 =',p2_dist)

p3_dist = x3 + p3
print('Distance3 =',p3_dist)
