'''
จากคราวที่แล้วที่นายเซฟคำนวณแฟคทอเรียล นายเซฟได้ประสบปัญหาค่าไฟแพงเกินไป นายเซฟจึงต้องการคำนวณค่าไฟ โดยการคำนวณค่าไฟสามารถหาได้จาก
ค่าไฟ = พลังงาน * เวลา * ค่าไฟต่อ 1 หน่วย
ค่าไฟ มีหน่วยเป็นบาท
พลังงาน มีหน่วยเป็นกิโลวัตต์ (kW)
เวลา มีหน่วยเป็นชั่วโมง
ค่าไฟต่อหน่วย มีหน่วยเป็น บาท
กำหนดให้ราคาค่าไฟต่อ 1 หน่วย มีค่าเท่ากับ 3 บาท
ซึ่งบ้านนายเซฟใช้เครื่องใช้ไฟฟ้าอยู่ 3 ชนิดคือ โทรทัศน์ใช้พลังงาน 0.12 kW เตารีดใช้พลังงาน 0.5 kW และหลอดไฟใช้พลังงาน 0.06 kW
วิธีการหาค่าไฟ
ให้หาราคาจากเครื่องใช้ไฟฟ้าทีละตัว แล้วมาบวกกันจะได้ราคารวม

In : จำนวนชั่วโมงการใช้เครื่องใช้ไฟฟ้า
tv:3
iron:2
lamp:7

Out :
5.34

'''

item1 = input()
item2 = input()
item3 = input()

item1_spl = item1.split(':')
item2_spl = item2.split(':')
item3_spl = item3.split(':')

tv_e = 0.12
iron_e = 0.5
lamp_e = 0.06
unit = 3

result1 = tv_e * int(item1_spl[1]) * unit
result2 = iron_e * int(item2_spl[1]) * unit
result3 = lamp_e * int(item3_spl[1]) * unit

result = result1 + result2 + result3
print(round(result,2))