'''
นาย สมดุ๋ย เป็นนักเดินทางรอบโลกที่มีชื่อเสียงโดยครั้งนี้เขาได้เดินทางมาที่ประเทศไทยซึ่งเมื่อเขามาถึงประเทศไทยเขาได้ตกตะลึงกับการจราจรที่ติดขัดในกรุงเทพ
เขาต้องการไปยังเมือง n โดยในขณะนั้นเขายังอยู่ที่เมืองที่ 1 และ ที่กรุงเทพนั้น
มีถนนสายหลักทั้งหมด k เส้นทาง เขาจึงขอร้องให้คุณผู้ซึ่งเป็นโปรแกรมเมอร์ระดับจักรวาล
ช่วยหาทางที่เขาจะไปยังเมือง n
โดยใช้เวลาน้อยที่สุด

บรรทัดที่ 1 รับค่า n k คือ จุดเริ่มต้น เมืองทั้งหมดในกรุงเทพ และ จำนวนเส้นทาง
อีก k บรรทัดต่อมา รับ ค่า x y z คือ ระยะทางจากจุด x ไปยัง จุด y ใช้เวลาทั้งหมด z นาที
เริ่มจาก 1 เสมอ
5 7     (ต้องการไป 5 รับค่า 7 ค่า)
1 2 4
1 4 6   (1 ไป 4 ใช้ 6 นาที)
2 4 8
2 3 2
4 5 1   (4 ไป 5 ใช้ 1 นาที)
3 5 7
2 5 9
>> รวม ใช้ 7 นาที

เริ่มจาก 1
8 9     (ไป 8 รับค่า 9)
1 2 6   (1 ไป 2 ใช้ 6)  (หาอันสุดท้าย)
1 3 4
2 5 7   (2 ไป 5 ใช้ 7)  (หาอันดับ 2)
1 6 9
3 7 1
5 8 2   (5 ไป 8 ใช่ 2)  (หาก่อนเลย จุดหมาย)
6 7 10
1 4 8
2 6 4
'''

user_input = '8 9' #input()
spl1, spl2 = user_input.split(' ')
last = int(spl1)
loop_get = int(spl2)

way = ['1 2 6',
'1 3 4',
'2 5 7',
'1 6 9',
'3 7 1',
'5 8 2',
'6 7 10',
'1 4 8',
'2 6 4']

'''
for i in range(0,loop_get) :
    x = input()
    way.append(x)
print(way)
'''
time = 0
#find last
target = last
way_lst = []
while target != 1 :
    for i in way:
        way_temp = []
        y = i.split(' ')
        way_lst.append(y)   #add for print
        way_temp.append(y)  #add for split
        a11,a22,a33 = i.split(' ')
        a1 = int(a11)
        a2 = int(a22)
        a3 = int(a33)
        if a2 == target :
            print('>>> target =',a2)
            time += a3
            target = a1
            break
        else:
            print('not target')

        print('now target =',target)
        print('time =',time)

print('last target =',target)
print('last time =',time)