'''
ทำการแสดงข้อมูลต่าง ๆ ของผู้ใช้ตามรูปแบบที่กำหนด
'''

x = input()
y = input()
date = input()

print('#############################')
print('#  _  _ ___ _    _    ___   #')
print('# | || | __| |  | |  / _ \\\  #')
print('# | __ | _|| |__| |_| (_) | #')
print('# |_||_|___|____|____\\\___/  #')
print('#                           #')
print('#############################')
print('=============================')
print('My name is      {} {}'.format(x,y))
print('My birthday is  {}'.format(date))
print('You can call me {}'.format(x))
print('=============================')