'''
ระยะทาง 1 กิโลเมตรแรก 35.00 บาท
ระยะทางเกินกว่า 1 กิโลเมตรถึงกิโลเมตรที่ 10 กิโลเมตรละ 5.50 บาท
ระยะทางเกินกว่า 10 กิโลเมตรถึงกิโลเมตรที่ 20 กิโลเมตรละ 6.50 บาท
ระยะทางเกินกว่า 20 กิโลเมตรถึงกิโลเมตรที่ 40 กิโลเมตรละ 7.50 บาท
ระยะทางเกินกว่า 40 กิโลเมตรถึงกิโลเมตรที่ 60 กิโลเมตรละ 8.00 บาท
ระยะทางเกินกว่า 60 กิโลเมตรถึงกิโลเมตรที่ 80 กิโลเมตรละ 9.00 บาท
ระยะทางเกินกว่า 80 กิโลเมตรขึ้นไป กิโลเมตรละ 10.50 บาท
'''

s = int(input()) #ระยะเดินทาง

sum = 35
while s > 1 :
    if s > 80 :
        sum += 10.5
        s -= 1
    elif 60 < s <= 80 :
        sum += 9
        s -= 1
    elif 40 < s <= 60 :
        sum += 8
        s -= 1
    elif 20 < s <= 40 :
        sum += 7.5
        s -= 1
    elif 10 < s <= 20 :
        sum += 6.5
        s -= 1
    elif 1 < s <= 10 :
        sum += 5.5
        s -= 1
    else:
        print('go else')

print(sum)